{"Link":{"0":"\/vinfo\/us\/security\/news\/vulnerabilities-and-exploits\/rediswannamine-cryptocurrency-mining-operation-found-targeting-servers-with-eternalblue","1":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/large-scale-heist-of-cryptocurrency-exchange-binance-fails","2":"\/vinfo\/us\/security\/news\/cyber-attacks\/lazarus-campaign-and-loopx-scam-show-that-cryptocurrency-industry-still-fraught-with-dangers","3":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/-coinhive-attacks-and-alleged-bitgrail-losses-highlight-cryptocurrency-security-issues","4":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/osx-creativeupdate-macos-cryptocurrency-miner-distributed-via-macupdate","5":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/coincheck-suffers-biggest-hack-in-cryptocurrency-experty-users-buy-false-ico","6":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/attackers-use-fake-spritecoin-cryptocurrency-to-lure-users-into-downloading-ransomware","7":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/electroneum-etn-cryptocurrency-targeted-by-webminer-delivered-via-malicious-advertisements","8":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/security-101-the-impact-of-cryptocurrency-mining-malware","9":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/magento-based-websites-hacked-to-steal-credit-card-data-and-install-cryptocurrency-mining-malware","10":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/-zealot-campaign-and-the-lazarus-group-end-the-year-with-cryptocurrency-mining-attacks","11":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/by-the-numbers-are-your-smart-home-devices-being-used-as-cryptocurrency-miners","12":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/-south-korean-cryptocurrency-exchange-bithumb-hacked","13":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/ransomware-recap-new-disguises-and-a-change-of-cryptocurrency","14":"https:\/\/www.securityweek.com\/coverity-scan-hacked-abused-cryptocurrency-mining","15":"https:\/\/www.securityweek.com\/cryptocurrency-miners-not-uncommon-industrial-systems","16":"https:\/\/www.securityweek.com\/monero-miner-sends-cryptocurrency-north-korean-university","17":"https:\/\/www.securityweek.com\/sambacry-flaw-exploited-deliver-cryptocurrency-miner","18":"https:\/\/www.securityweek.com\/linux-malware-targets-raspberry-pi-cryptocurrency-mining","19":"https:\/\/www.securityweek.com\/sundown-exploit-kit-variant-distributes-cryptocurrency-miner","20":"\/vinfo\/us\/threat-encyclopedia\/spam\/3630\/cryptocurrencyrelated-spam-mails-currently-on-the-rise","21":"https:\/\/www.securityweek.com\/icos-lawless-land-cryptocurrency-fundraising","22":"https:\/\/www.securityweek.com\/c4-bitgo-publish-draft-cryptocurrency-security-standard","23":"https:\/\/www.securityweek.com\/cryptocurrency-mining-malware-hits-monitoring-systems-european-water-utility","24":"https:\/\/www.securityweek.com\/nas-devices-used-spread-cryptocurrency-mining-malware","25":"https:\/\/www.securityweek.com\/go-based-linux-trojan-used-cryptocurrency-mining"},"Title":{"0":"RedisWannaMine Cryptocurrency-Mining Operation Found Targeting Servers with EternalBlue","1":"Large-Scale Heist of Cryptocurrency Exchange Binance Fails","2":"Lazarus Campaign and LoopX Scam Show That Cryptocurrency Industry Still Fraught With Dangers","3":" Coinhive Attacks and Alleged Bitgrail Losses Highlight Cryptocurrency Security Issues","4":"OSX.CreativeUpdate macOS Cryptocurrency Miner Distributed via MacUpdate ","5":"Coincheck Suffers Biggest Hack in Cryptocurrency History; Experty Users Tricked into Buying False ICO","6":"Attackers Use Fake SpriteCoin Cryptocurrency to Lure Users into Downloading Ransomware","7":"Electroneum (ETN) Cryptocurrency Targeted by Webminer Delivered via Malicious Advertisements","8":"Security 101: The Impact of Cryptocurrency-Mining Malware","9":"Magento-Based Websites Hacked to Steal Credit Card Data and Install Cryptocurrency-Mining Malware","10":"“Zealot” Campaign and the Lazarus Group End the Year With Cryptocurrency Mining Attacks","11":"By the Numbers: Are Your Smart Home Devices Being Used as Cryptocurrency Miners? ","12":" South Korean Cryptocurrency Exchange Bithumb Hacked","13":"Ransomware Recap: New Disguises and a Change of Cryptocurrency","14":"Coverity Scan Hacked, Abused for Cryptocurrency Mining","15":"Cryptocurrency Miners Not Uncommon on Industrial Systems","16":"Monero Miner Sends Cryptocurrency to North Korean University","17":"SambaCry Flaw Exploited to Deliver Cryptocurrency Miner","18":"Linux Malware Targets Raspberry Pi for Cryptocurrency Mining","19":"Sundown Exploit Kit Variant Distributes Cryptocurrency Miner","20":"Cryptocurrency-related Spam Mails Currently On The Rise","21":"ICOs: The Lawless Land of Cryptocurrency Fundraising","22":"C4, BitGo Publish Draft of CryptoCurrency Security Standard","23":"Cryptocurrency Mining Malware Hits Monitoring Systems at European Water Utility","24":"NAS Devices Used to Spread Cryptocurrency Mining Malware","25":"Go-Based Linux Trojan Used for Cryptocurrency Mining"},"Intro":{"0":"A new cryptocurrency-mining operation they named RedisWannaMine was uncovered targeting database and application servers by exploiting the notorious EternalBlue.\r\r\r\r\n\r\r\r\r\n","1":"Users of cryptocurrency exchange Binance began noticing irregular trading on the platform a few days ago. An investigation revealed an organized and large-scale scheme to transfer bitcoin to several malicious actors. Automatic alarms were triggered and Binance","2":"Two cryptocurrency incidents made the news recently: one concerning a new campaign from the threat actor known as the Lazarus Group, and the other involving a scam by one of the many new cryptocurrency startups.","3":"Two cryptocurrency-related security incidents occurred during the past couple of days, adding to the rising number of attacks that target digital currency.","4":"A new cryptocurrency-mining malware was uncovered targeting macOS systems: — OSX.CreativeUpdate Here's what you need to know. ","5":"Coincheck suffers a massive cryptocurrency hack while Experty users are tricked into buying a false ICO. What does this mean for the safety of cryptocurrency investors?","6":"A recent campaign was found using social engineering methods to take advantage of the increasing hype and visibility of cryptocurrencies via a fictional cryptocurrency called SpriteCoin, which is used as a ransomware lure for unsuspecting users.","7":"Trend Micro observed a recent spate of attacks designed to deliver a webminer for the Electroneum (ETN) cryptocurrency.\r\r\r\r\n\r\r\r\r\n","8":"As cryptocurrencies like bitcoin are more widely used, so will the threats that cybercriminals use to abuse it. Here’s a closer look at cryptocurrency-mining malware—their emergence in the threat landscape, impact, and some countermeasures against them.","9":"Security researchers reported that at least 1,000 websites running on the Magento platform were targeted via brute-force attacks to steal credit card data and install cryptocurrency-mining malware.","10":"With cryptocurrency prices hitting new highs recently, it’s no surprise that cybercriminals are starting to become more aggressive in terms of profiting from these digital currencies. ","11":"Our data shows a huge increase in home network attacks attempting cryptocurrency mining activities. This spike coincides with the recent rise in the value of major cryptocurrencies.  ","12":"One of the largest cryptocurrency exchange platforms in the world was hacked, with thousands of user accounts compromised.   ","13":"This week we see ransomware disguise itself as a PC game, a popular sci-fi hero also makes an appearance, and new cryptocurrency starts to gain traction.  ","14":"Synopsys tells customers to change their passwords for Coverity Scan after the service was hacked and abused for cryptocurrency mining  [Read More]","15":"Cryptocurrency mining malware is not uncommon on industrial systems, according to several cybersecurity firms  [Read More]","16":"An application compiled just weeks ago was found to be an installer for a Monero miner designed to send the mined currency to a North Korean university, AlienVault reports.  [Read More]","17":"Recently patched Samba flaw known as EternalRed and SambaCry exploited to deliver a cryptocurrency miner  [Read More]","18":"A piece of Linux malware dubbed MulDrop targets Raspberry Pi devices and abuses them for cryptocurrency mining  [Read More]","19":"A variant of the Sundown exploit kit (EK) was recently seen using a different infrastructure than previously known and distributing a cryptocurrency mining application.  [Read More]","20":"Cryptocurrency is the hot new topic nowadays, so it's no surprise that cybercriminals will start to use it as a way to get users to click on their malicious spam mail. For the past few days, we have seen an increase in the number of cryptocurrency-related spam emails.Read more   ","21":"From raising $30 million in 30 seconds to being endorsed by Paris Hilton or vanishing into thin air: anything is possible in the risky new world of cryptocurrency fundraising, but regulators are lurking.  [Read More]","22":"A draft of the CryptoCurrency Security Standard (CCSS) has been made available for public discussion by C4 and BitGo.  [Read More]","23":"Cryptocurrency mining malware worked its way onto four servers connected to an operational technology (OT) network at a wastewater facility in Europe, industrial cybersecurity firm Radiflow told SecurityWeek Wednesday.  [Read More]","24":"A malware that uses infected computers to mine Monero cryptocurrency leverages NAS devices for distribution  [Read More]","25":"A new Linux Trojan developed in Go has been used by cybercriminals for cryptocurrency mining  [Read More]"}}