{"Link":{"0":"https:\/\/www.securityweek.com\/chrome-firefox-users-exposed-unicode-domain-phishing","1":"https:\/\/www.securityweek.com\/firefox-adds-improved-download-protection","2":"https:\/\/www.securityweek.com\/fileless-trojan-kovter-poses-firefox-update","3":"https:\/\/www.securityweek.com\/improved-malware-protection-introduced-firefox-browser","4":"https:\/\/www.securityweek.com\/mozilla-firefox-beta-mandates-use-secure-connections-certain-sites","5":"https:\/\/www.securityweek.com\/test-shows-ie9-beats-chrome-safari-firefox-overall-malware-detection","6":"https:\/\/www.securityweek.com\/adobe-offer-silent-updates-mac-os-and-protection-firefox","7":"https:\/\/www.securityweek.com\/firefox-gets-click-play-plugin-additional-layer-security","8":"https:\/\/www.securityweek.com\/password-stealing-firefox-add-surfaces","9":"\/vinfo\/us\/threat-encyclopedia\/spam\/242\/fake-mozilla-firefox-8-update-email-leads-to-malware","10":"https:\/\/www.securityweek.com\/mozilla-conducts-security-audit-firefox-accounts","11":"https:\/\/www.securityweek.com\/mozilla-remove-ca-certificate-turkish-organization-firefox-38","12":"https:\/\/www.securityweek.com\/mozilla-isolates-facebook-new-firefox-extension","13":"https:\/\/www.securityweek.com\/firefox-block-canvas-based-browser-fingerprinting","14":"https:\/\/www.securityweek.com\/tor-browser-patches-start-being-uplifted-firefox","15":"https:\/\/www.securityweek.com\/firefox-10-year-anniversary-release-focuses-privacy","16":"https:\/\/www.securityweek.com\/anonymizer-releases-beta-version-nevercookie-firefox-plugin","17":"https:\/\/www.securityweek.com\/firefox-fails-keeping-passwords-secure-developer-claims","18":"https:\/\/www.securityweek.com\/firefox-51-patches-flaws-introduces-new-http-warning","19":"https:\/\/www.securityweek.com\/firefox-tor-browser-vulnerable-malicious-add-attacks","20":"https:\/\/www.securityweek.com\/firefox-63-distrust-all-symantec-root-certificates","21":"https:\/\/www.securityweek.com\/firefox-display-error-when-encountering-sha-1-certificates","22":"https:\/\/www.securityweek.com\/firefox-warns-password-requests-over-http","23":"https:\/\/www.securityweek.com\/firefox-44-drops-rc4-gets-push-notifications","24":"https:\/\/www.securityweek.com\/mozilla-re-enables-support-sha-1-firefox","25":"https:\/\/www.securityweek.com\/mozilla-introduce-new-certificate-revocation-feature-firefox-37","26":"https:\/\/www.securityweek.com\/firefox-57-get-new-xss-protections","27":"https:\/\/www.securityweek.com\/firefox-52-warns-login-fields-insecure-pages","28":"https:\/\/www.securityweek.com\/firefox-users-fingerprinted-cached-intermediate-ca-certificates","29":"https:\/\/www.securityweek.com\/popular-firefox-add-ons-expose-users-new-attack","30":"https:\/\/www.securityweek.com\/mozilla-patches-critical-code-execution-flaw-firefox","31":"https:\/\/www.securityweek.com\/firefox-support-windows-xp-and-vista-ends-june-2018","32":"https:\/\/www.securityweek.com\/mozilla-patches-firefox-flaw-disclosed-pwn2own","33":"https:\/\/www.securityweek.com\/cisco-patches-webex-flaw-firefox-ie-plugins","34":"https:\/\/www.securityweek.com\/mozilla-kill-firefox-windows-xp-vista-2017","35":"https:\/\/www.securityweek.com\/mozilla-patches-firefox-zero-day-exploited-unmask-tor-users","36":"https:\/\/www.securityweek.com\/firefox-50-patches-27-vulnerabilities","37":"https:\/\/www.securityweek.com\/firefox-49-patches-critical-high-severity-vulnerabilities","38":"https:\/\/www.securityweek.com\/firefox-blocks-flash-content-improve-security","39":"https:\/\/www.securityweek.com\/mozilla-debuts-containers-feature-firefox-nightly","40":"https:\/\/www.securityweek.com\/critical-vulnerabilities-patched-release-firefox-47","41":"https:\/\/www.securityweek.com\/critical-high-severity-flaws-patched-firefox","42":"https:\/\/www.securityweek.com\/firefox-45-patches-22-critical-vulnerabilities","43":"https:\/\/www.securityweek.com\/mozilla-updates-firefox-patch-critical-flaws","44":"https:\/\/www.securityweek.com\/mozilla-patches-critical-flaws-release-firefox-43","45":"https:\/\/www.securityweek.com\/firefox-41-patches-critical-vulnerabilities","46":"https:\/\/www.securityweek.com\/unpatched-firefox-flaws-exposed-bugzilla-breach","47":"https:\/\/www.securityweek.com\/mozilla-updates-firefox-40-patch-two-serious-flaws","48":"https:\/\/www.securityweek.com\/firefox-40-patches-vulnerabilities-expands-malware-protection","49":"https:\/\/www.securityweek.com\/mozilla-patches-firefox-zero-day-exploited-wild","50":"https:\/\/www.securityweek.com\/mozilla-patches-critical-vulnerabilities-release-firefox-39","51":"https:\/\/www.securityweek.com\/mozilla-offers-more-money-firefox-vulnerabilities","52":"https:\/\/www.securityweek.com\/mozilla-patches-13-vulnerabilities-release-firefox-38","53":"https:\/\/www.securityweek.com\/mozilla-disables-opportunistic-encryption-firefox-after-security-flaw-discovered","54":"https:\/\/www.securityweek.com\/mozilla-patches-critical-vulnerabilities-release-firefox-37","55":"https:\/\/www.securityweek.com\/mozilla-fixes-firefox-vulnerabilities-disclosed-pwn2own-2015","56":"https:\/\/www.securityweek.com\/mozilla-fixes-17-vulnerabilities-firefox-36","57":"https:\/\/www.securityweek.com\/mozilla-fixes-9-vulnerabilities-firefox-35","58":"https:\/\/www.securityweek.com\/mozilla-fixes-vulnerabilities-disables-ssl-30-firefox-34","59":"https:\/\/www.securityweek.com\/firefox-32-brings-security-fixes-public-key-pinning","60":"https:\/\/www.securityweek.com\/chrome-firefox-updates-address-security-vulnerabilities","61":"https:\/\/www.securityweek.com\/vupen-details-firefox-use-after-free-vulnerability-exploited-pwn2own","62":"https:\/\/www.securityweek.com\/mozilla-releases-firefox-17-2300-bug-fixes","63":"https:\/\/www.securityweek.com\/mozilla-patches-firefox-again-releases-version-1602","64":"https:\/\/www.securityweek.com\/mozilla-yanks-firefox-version-16-over-security-vulnerability","65":"https:\/\/www.securityweek.com\/firesheep-extension-firefox-enables-hacking-masses-hijacks-browser-sessions-ease","66":"https:\/\/www.securityweek.com\/malicious-firefox-chrome-extension-hijacks-facebook-profiles","67":"https:\/\/www.securityweek.com\/mozilla-implements-faster-diffie-hellman-function-firefox","68":"https:\/\/www.securityweek.com\/mozilla-completely-ban-wosign-startcom-certificates-firefox-58","69":"https:\/\/www.securityweek.com\/firefox-makes-adobe-flash-click-activate-default"},"Title":{"0":"Chrome, Firefox Users Exposed to Unicode Domain Phishing","1":"Firefox Adds Improved Download Protection","2":"Fileless Trojan Kovter Poses as Firefox Update","3":"Improved Malware Protection Introduced in Firefox Browser","4":"Mozilla Firefox Beta Mandates Use of Secure Connections for Certain Sites","5":"Test Shows IE9 Beats Chrome, Safari, Firefox in Overall Malware Detection","6":"Adobe to Offer Silent Updates for Mac OS and Protection on Firefox","7":"Firefox Adds \"Click-to-play\" Plugin as Additional Layer of Security","8":"Password Stealing Firefox Add-On Surfaces","9":"Fake Mozilla Firefox 8 Update Email Leads to Malware","10":"Mozilla Conducts Security Audit of Firefox Accounts","11":"Mozilla to Remove CA Certificate of Turkish Organization in Firefox 38","12":"Mozilla Isolates Facebook with New Firefox Extension","13":"Firefox to Block Canvas-based Browser Fingerprinting","14":"Tor Browser Patches Start Being Uplifted into Firefox","15":"Firefox 10-Year Anniversary Release Focuses on Privacy","16":"Anonymizer Releases Beta Version of Nevercookie Firefox Plugin","17":"Firefox Fails at Keeping Passwords Secure, Developer Claims","18":"Firefox 51 Patches Flaws, Introduces New HTTP Warning","19":"Firefox, Tor Browser Vulnerable to Malicious Add-on Attacks","20":"Firefox 63 to Distrust All Symantec Root Certificates","21":"Firefox to Display Error When Encountering SHA-1 Certificates","22":"Firefox Warns of Password Requests Over HTTP","23":"Firefox 44 Drops RC4, Gets Push Notifications","24":"Mozilla Re-Enables Support for SHA-1 in Firefox","25":"Mozilla to Introduce New Certificate Revocation Feature in Firefox 37","26":"Firefox 57 to Get New XSS Protections","27":"Firefox 52 Warns of Login Fields on Insecure Pages","28":"Firefox Users Fingerprinted via Cached Intermediate CA Certificates","29":"Popular Firefox Add-ons Expose Users to New Attack","30":"Mozilla Patches Critical Code Execution Flaw in Firefox","31":"Firefox Support for Windows XP and Vista Ends June 2018","32":"Mozilla Patches Firefox Flaw Disclosed at Pwn2Own","33":"Cisco Patches WebEx Flaw in Firefox, IE Plugins","34":"Mozilla to Kill Firefox for Windows XP, Vista in 2017","35":"Mozilla Patches Firefox Zero-Day Exploited to Unmask Tor Users","36":"Firefox 50 Patches 27 Vulnerabilities","37":"Firefox 49 Patches Critical, High Severity Vulnerabilities","38":"Firefox Blocks Flash Content to Improve Security","39":"Mozilla Debuts Containers Feature in Firefox Nightly","40":"Critical Vulnerabilities Patched With Release of Firefox 47","41":"Critical, High Severity Flaws Patched in Firefox","42":"Firefox 45 Patches 22 Critical Vulnerabilities","43":"Mozilla Updates Firefox to Patch Critical Flaws","44":"Mozilla Patches Critical Flaws With Release of Firefox 43","45":"Firefox 41 Patches Critical Vulnerabilities","46":"Unpatched Firefox Flaws Exposed in Bugzilla Breach","47":"Mozilla Updates Firefox 40 to Patch Two Serious Flaws","48":"Firefox 40 Patches Vulnerabilities, Expands Malware Protection","49":"Mozilla Patches Firefox Zero-Day Exploited in the Wild","50":"Mozilla Patches Critical Vulnerabilities With Release of Firefox 39","51":"Mozilla Offers More Money for Firefox Vulnerabilities","52":"Mozilla Patches 13 Vulnerabilities With Release of Firefox 38","53":"Mozilla Disables Opportunistic Encryption in Firefox After Security Flaw Discovered","54":"Mozilla Patches Critical Vulnerabilities With Release of Firefox 37","55":"Mozilla Fixes Firefox Vulnerabilities Disclosed at Pwn2Own 2015","56":"Mozilla Fixes 17 Vulnerabilities in Firefox 36","57":"Mozilla Fixes 9 Vulnerabilities in Firefox 35","58":"Mozilla Fixes Vulnerabilities, Disables SSL 3.0 in Firefox 34","59":"Firefox 32 Brings Security Fixes, Public Key Pinning","60":"Chrome, Firefox Updates Address Security Vulnerabilities","61":"Vupen Details Firefox Use-After-Free Vulnerability Exploited at Pwn2Own","62":"Mozilla Releases Firefox 17 With 2,300 Bug Fixes","63":"Mozilla Patches Firefox Again - Releases Version 16.0.2","64":"Mozilla Yanks Firefox Version 16 Over Security Vulnerability","65":"Firesheep Extension for Firefox Enables Hacking for the Masses, Hijacks Browser Sessions With Ease","66":"Malicious Firefox, Chrome Extension Hijacks Facebook Profiles","67":"Mozilla Implements Faster Diffie-Hellman Function in Firefox","68":"Mozilla to Completely Ban WoSign, StartCom Certificates in Firefox 58","69":"Firefox Makes Adobe Flash Click-to-Activate by Default"},"Intro":{"0":"Chrome, Firefox and Opera expose their users to phishing attacks that rely on Unicode domain names  [Read More]","1":"Mozilla said that download protection in Firefox 48 has ben expanded to include potentially unwanted software and uncommon downloads.  [Read More]","2":"A new version of the Kovter ad Trojan was recently observed to pose as a Firefox update while abusing a legitimate certificate to ensure successful infection.  [Read More]","3":"Starting with Firefox 31, the malware detection mechanism integrated into the Web browser has been expanded to include downloaded files, Mozilla announced on Wednesday.  [Read More]","4":"Mozilla is following in the footsteps of Google Chrome with its use of HSTS, a mechanism where a webserver declares that a web browser can only interact with it using secure connections such as HTTPS.  [Read More]","5":"In a recent test conducted by NSS Labs, Internet Explorer performed the best, blocking 95 percent of malicious activity  [Read More]","6":"Version 11.3 of Adobe’s Flash Player, due in June, will provide the same silent update feature currently available to Windows users to those running OS X. In addition, Adobe will also offer a new security enhancement to Firefox called protected mode.  [Read More]","7":"When enabled, “click-to-play” will require Firefox plugins to have an additional click – or manual activation – before rendering Web content.  [Read More]","8":"A malicious Firefox add-on was discovered this week that managed to be uploaded to and hosted on the official Mozilla Add-ons site.  [Read More]","9":"Trend Micro researchers recently received a mail notification that advertises the new Mozilla Firefox 8.0, purportedly from Mozilla Firefox.Read more   ","10":"A security audit of Firefox Accounts revealed a total of 15 issues, including flaws rated critical and high severity  [Read More]","11":"Mozilla will remove the CA certificate of Turkish company E-Guven in Firefox due to outdated and insufficient audits.  [Read More]","12":"Mozilla's new \"Facebook Container Extension\" is a new browser extension designed to help Firefox users reduce the ability of Facebook to track their activity across other web sites.  [Read More]","13":"Firefox will soon provide users with increased privacy by blocking browser fingerprinting performed through the HTML5 canvas element.  [Read More]","14":"The Tor (The Onion Router) team and Mozilla are working together to implement Tor browser patches directly into Firefox and tighten their collaboration.  [Read More]","15":"A new version of Firefox released by Mozilla to mark the Web browser's 10-year anniversary introduces features designed to help users protect their privacy.  [Read More]","16":"Anonymizer, has released a beta version of Nevercookie, the recently announced Firefox plugin designed to protect against the Evercookie.  [Read More]","17":"Firefox does a poor job at securing stored passwords even if the user has set up a master password, a software developer claims.  [Read More]","18":"Firefox 51 patches several critical vulnerabilities and warns users when a website that collects passwords doesn’t use HTTPS  [Read More]","19":"A vulnerability related to certificate pinning allows sophisticated MitM attackers to deliver malicious add-ons to Firefox and Tor Browser users  [Read More]","20":"Mozilla this week detailed its plans to completely distrust Symantec root certificates in Firefox 63, set to arrive in October 2018.  [Read More]","21":"Starting in Firefox 51, Mozilla’s web browser will display an error when a SHA-1 certificate is encountered that chains up to a root certificate included in Mozilla’s CA Certificate Program.  [Read More]","22":"Starting with Firefox DevEdition 46, developers will be informed about this privacy and security risk by displaying a lock with a red strikethrough when passwords are requested on non-secure pages.  [Read More]","23":"Firefox 44, the latest version of Mozilla’s web browser, is now available for download and comes with a series of security patches, and has fully removed support for the RC4 cipher.  [Read More]","24":"Firefox 43.0.4 no longer rejects new SSL certificates that use the SHA-1 cryptographic hash function.  [Read More]","25":"Mozilla will introduce OneCRL to streamline the certificate revocation process. The feature will be available starting with Firefox 37.  [Read More]","26":"Mozilla announced plans to boost the Cross-Site-Scripting (XSS) protections in Firefox by treating data URLs as unique origin.  [Read More]","27":"The latest version of the Firefox Web browser warns users when they are entering their passwords on pages that are not secure.  [Read More]","28":"An attacker can discover various details about Firefox users due to the manner in which the browser caches intermediate CA certificates, a researcher has discovered.  [Read More]","29":"Researchers detail a new attack method that leverages the lack of isolation between Firefox browser extensions  [Read More]","30":"Mozilla updates Firefox to patch a critical vulnerability that allows a remote attacker to execute arbitrary code (CVE-2018-5124)  [Read More]","31":"Mozilla announced that support for Microsoft's Windows XP and Vista operating systems will be completely removed in June 2018.  [Read More]","32":"Mozilla has already patched the vulnerability disclosed last week at the Pwn2Own 2017 hacking competition  [Read More]","33":"Cisco patches recently disclosed WebEx vulnerability in Firefox and Internet Explorer plugins  [Read More]","34":"Support for Windows XP and Vista will be removed from Firefox, currently the last major web browser out there to still support the two outdated operating system versions.  [Read More]","35":"Updates released for Firefox and the Tor Browser patch the zero-day vulnerability exploited, possibly by law enforcement, to unmask Tor users  [Read More]","36":"Mozilla this week released Firefox 50 in the stable channel to patch 27 vulnerabilities and to provide users with improved Download Protection.  [Read More]","37":"Mozilla has patched over a dozen critical and high severity vulnerabilities with the release of Firefox 49, including a recently disclosed certificate pinning issue  [Read More]","38":"Starting next month, the Firefox Web browser will block certain Flash content to improve the security of its users and to ensure faster page loads.  [Read More]","39":"Dubbed Containers, a few feature in Firefox is meant to allow people use different browser tabs for different contexts, including work, banking, shopping, or personal.  [Read More]","40":"Mozilla releases Firefox 47. The latest version patches over a dozen vulnerabilities, including critical issues  [Read More]","41":"Mozilla patches 14 vulnerabilities, including critical and high severity issues, with the release of Firefox 46  [Read More]","42":"Mozilla has released the stable version of Firefox 45 to resolve 40 vulnerabilities in the browser, 22 of which are rated Critical.  [Read More]","43":"Mozilla released updates for the standard and ESR versions of Firefox last week to patch vulnerabilities rated critical  [Read More]","44":"Firefox 43 is available for download and it brings fixes for 21 vulnerabilities, including several issues rated critical  [Read More]","45":"Firefox 41 is available for download. The latest version of Mozilla’s web browser patches 30 vulnerabilities.  [Read More]","46":"A hacker gained access to the details of 185 bugs affecting Firefox and other Mozilla products after hijacking a Bugzilla account.  [Read More]","47":"Mozilla has updated Firefox 40 to patch a couple of critical and high severity vulnerabilities.  [Read More]","48":"Firefox 40 released. The latest version brings vulnerability patches, expanded malware protection, and support for Windows 10.  [Read More]","49":"Mozilla has released an emergency update to address a Firefox zero-day vulnerability exploited in the wild to steal sensitive files.  [Read More]","50":"Firefox 39 patches two dozen vulnerabilities, including 13 critical issues and the Logjam crypto bug.  [Read More]","51":"Mozilla is offering more money to researchers who find Firefox vulnerabilities. Bounty hunters will also be listed in the recently launched Hall of Fame.  [Read More]","52":"Five critical vulnerabilities have been fixed by Mozilla with the release of Firefox 38. The company also integrated Adobe CDM for DRM-wrapped content playback.  [Read More]","53":"Mozilla disabled the opportunistic encryption feature in Firefox after the discovery of a security vulnerability.  [Read More]","54":"Mozilla has fixed more than a dozen vulnerabilities with the release of Firefox 37. Several of the flaws have been rated critical.  [Read More]","55":"Two security holes rated critical have been addressed with the release of Firefox 36.0.4. The issues were reported at Pwn2Own 2015.  [Read More]","56":"Mozilla Firefox 36 is available for download. 17 vulnerabilities have been fixed in the popular Web browser.  [Read More]","57":"Mozilla released Firefox 35 on Tuesday. In addition to new features, changes and fixes, the latest version of the popular Web browser addresses several critical vulnerabilities.  [Read More]","58":"Mozilla released Firefox 34 which disables Secure Sockets Layer (SSL) 3.0 support to protect users against Padding Oracle On Downgraded Legacy Encryption (POODLE) attacks.  [Read More]","59":"Firefox 32 for Windows, Linux, Mac and Android includes fixes for several security vulnerabilities and support for public key pinning.  [Read More]","60":"Mozilla has released Firefox 30 which fixes a total of seven vulnerabilities affecting the Web browser. Google has also updated its Chrome Web Browser to address four security holes.  [Read More]","61":"The firm pulls the covers away from a vulnerability they used to take down the browser at the contest.  [Read More]","62":"Mozilla has released the version 17 of its Firefox Web browser, which addresses a massive batch of 2,365 bugs and fixes 16 security issues.  [Read More]","63":"Firefox Version 16.0.2 patches the browser against XSS attacks that could target the LocationObject.  [Read More]","64":"Mozilla has removed the latest version (16) of their Web browser just over a day after it was released, due to a vulnerability that was discovered after it had shipped.  [Read More]","65":"With the right setup, using the “FireSheep” extension for Firefox, you can be logged into someone’s facebook (or any other of the supported sites) within seconds.  [Read More]","66":"Microsoft warned Facebook users about a malicious extension targeting Google Chrome or Mozilla Firefox users that can make posts, 'Like' pages and take other actions on infected systems.  [Read More]","67":"Mozilla revealed plans to introduce a new key establishment (Curve25519) algorithm in Firefox to improve both security and performance.  [Read More]","68":"Mozilla said it would completely remove trust in the digital certificates issued by Chinese certificate authority WoSign and its subsidiary StartCom starting with Firefox 58.  [Read More]","69":"Adobe Flash plugin is no longer active by default starting with Firefox 55, and users of the new version will be required to activate it for each website they visit.  [Read More]"}}