{"Link":{"0":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/attack-uses-fake-google-docs-application-to-access-gmail-accounts","1":"https:\/\/www.securityweek.com\/myanmar-denies-involvement-hack-journalists-google-gmail-accounts","2":"https:\/\/www.securityweek.com\/phished-gmail-accounts-immediately-accessed-hackers","3":"https:\/\/www.securityweek.com\/gmail-flags-unauthenticated-messages-dangerous-urls","4":"https:\/\/www.securityweek.com\/new-kedi-rat-uses-gmail-exfiltrate-data","5":"https:\/\/www.securityweek.com\/students-sue-google-over-gmail-account-scanning","6":"https:\/\/www.securityweek.com\/iran-unblocks-access-gmail","7":"https:\/\/www.securityweek.com\/iran-blocks-access-gmail","8":"https:\/\/www.securityweek.com\/google-soon-kill-sslv3-rc4-support-gmail","9":"https:\/\/www.securityweek.com\/google-stops-scanning-gmail-content-ad-targeting","10":"https:\/\/www.securityweek.com\/indian-government-wakes-risk-hotmail-gmail","11":"https:\/\/www.securityweek.com\/google-boosts-security-gmail-and-google-talk-oauth-20","12":"https:\/\/www.securityweek.com\/googles-dlp-gmail-adds-optical-character-recognition","13":"https:\/\/www.securityweek.com\/google-launches-data-loss-prevention-dlp-gmail","14":"https:\/\/www.securityweek.com\/gmail-drops-support-chrome-windows-xp-and-vista","15":"https:\/\/www.securityweek.com\/google-gmail-app-ios-doesnt-perform-certificate-pinning-researchers","16":"https:\/\/www.securityweek.com\/google-rolls-out-business-focused-security-enhancements-gmail","17":"https:\/\/www.securityweek.com\/gmail-delivers-spoofed-messages-without-warning-researchers-find","18":"https:\/\/www.securityweek.com\/gmail-block-javascript-file-attachments","19":"https:\/\/www.securityweek.com\/google-enhances-security-alerts-gmail","20":"https:\/\/www.securityweek.com\/gmail-warn-when-messages-take-unencrypted-routes","21":"https:\/\/www.securityweek.com\/gmail-blocking-suspicious-addresses-containing-non-latin-characters","22":"https:\/\/www.securityweek.com\/google-boosts-security-gmail-infrastructure","23":"https:\/\/www.securityweek.com\/undisclosed-glitch-disrupts-gmail-two-hours","24":"https:\/\/www.securityweek.com\/google-reports-huge-drop-hacked-gmail-accounts"},"Title":{"0":"Attack Uses Fake Google Docs Application to Access Gmail Accounts","1":"Myanmar Denies Involvement in Hack of Journalists' Google Gmail Accounts","2":"Phished Gmail Accounts Immediately Accessed by Hackers","3":"Gmail Flags Unauthenticated Messages, Dangerous URLs","4":"New Kedi RAT Uses Gmail to Exfiltrate Data","5":"Students Sue Google over Gmail Account Scanning","6":"Iran Unblocks Access to Gmail","7":"Iran Blocks Access to Gmail","8":"Google to Soon Kill SSLv3, RC4 Support in Gmail","9":"Google Stops Scanning Gmail Content for Ad Targeting","10":"Indian Government Wakes up to Risk of Hotmail, Gmail","11":"Google Boosts Security For GMail and Google Talk With OAuth 2.0","12":"Google's DLP for Gmail Adds Optical Character Recognition","13":"Google Launches Data Loss Prevention (DLP) for Gmail","14":"Gmail Drops Support for Chrome on Windows XP and Vista","15":"Google Gmail App for iOS Doesn't Perform Certificate Pinning: Researchers","16":"Google Rolls Out Business-Focused Security Enhancements for Gmail","17":"Gmail Delivers Spoofed Messages Without Warning, Researchers Find","18":"Gmail to Block JavaScript File Attachments","19":"Google Enhances Security Alerts in Gmail","20":"Gmail to Warn When Messages Take Unencrypted Routes","21":"Gmail Blocking Suspicious Addresses Containing Non-Latin Characters","22":"Google Boosts Security of Gmail Infrastructure","23":"Undisclosed Glitch Disrupts Gmail for Two Hours","24":"Google Reports Huge Drop in Hacked Gmail Accounts"},"Intro":{"0":"A new attack targeting Gmail users involves a fake Google Docs application.","1":"The Myanmar government denies responsibility for a hack targeting both foreign and local journalists.  [Read More]","2":"Gmail phishing attack: cybercriminals use cleverly designed URLs and they immediately access the hacked accounts  [Read More]","3":"Gmail is now alerting Android users whenever they receive a message that can’t be authenticated with either Sender Policy Framework (SPF) or DKIM.  [Read More]","4":"Kedi RAT is a newly discovered remote access Trojan (RAT) capable of evading security scanners communicates with its command and control (C&C) server via Gmail.  [Read More]","5":"A group of former and current students have sued Google in federal court in San Jose, California, alleging that the company scanned their Gmail accounts and gathered data for advertising purposes.  [Read More]","6":"Mohammad Reza Miri, a member of the telecommunications ministry in Iran, said a recent Gmail block was an \"involuntary\" consequence of trying to reinforce censorship of Google's YouTube video-sharing site.  [Read More]","7":"Iran blocked access to Google's popular and relatively secure Gmail service Monday amid first steps by the Islamic republic to establish a walled-off national intranet separate from the worldwide Internet.  [Read More]","8":"Starting on June 16, 2016, the old SSLv3 and RC4 security protocols will no longer be supported on Google’s SMTP servers and on Gmail’s web servers.  [Read More]","9":"Google on Friday announced plans to stop scanning the content of consumer Gmail addresses for personalizing the ads it serves to users.  [Read More]","10":"India has begun drawing up a new email policy to help secure government communications, but the man responsible for drafting the rules still regularly uses Hotmail.  [Read More]","11":"Google announced that IMAP\/SMTP and XMPP would be getting a security boost in the form of OAuth 2.0. The transition comes as the company depreciates older standards (OAuth 1.0a) on the GMail and Google Talk services.  [Read More]","12":"DLP for Gmail now includes Optical Character Recognition (OCR) for improved attachment scanning, a new set of predefined content detectors, and increased control over content detection thresholds.  [Read More]","13":"Google this week announced Data Loss Prevention (DLP) for Gmail, designed to help Google Apps for Work customers keep their sensitive information secure.  [Read More]","14":"Gmail will soon drop support for Chrome version 53 and below, a move expected to hit Windows XP and Vista users the most.  [Read More]","15":"Researchers at Lacoon Mobile Security discuss an issue impacting the Gmail application for iOS they believe could help an attacker launching man-in-the-middle attacks.  [Read More]","16":"Google today announced a series of improvements to Gmail’s security aimed at making the service better at protecting business data.  [Read More]","17":"Spoofed emails could easily land in user’s Gmail inboxes without even warning them of suspicious activity, security researchers have discovered.  [Read More]","18":"Google announced that JavaScript (.js) file attachments will be blocked by Gmail starting with February 13 for security reasons  [Read More]","19":"Google is boosting the security of its Gmail service in an effort to keep them protected from phishing attacks, malware, and other threats.  [Read More]","20":"Google plans to ramp up security for Gmail by letting users know when messages arrive via unencrypted connections that could be prone to snooping or tampering.  [Read More]","21":"Google has updated Gmail spam filters to block out emails coming from addresses using suspicious combinations of Latin and non-Latin characters, the company said on Tuesday.  [Read More]","22":"Google announced that its Gmail service would use added encryption to protect against eavesdropping and keep messages secure.  [Read More]","23":"Google suffered disruptions on several of its cloud-based services including Gmail for about two hours Wednesday for reasons that were not disclosed.  [Read More]","24":"In a blog post on the company’s war against scams and spam, Google announced on Tuesday that they’ve worked-up a method that is stopping nearly all of the attacks aimed at Gmail account holders.  [Read More]"}}