{"Link":{"0":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/hackers-exploit-instagram-api-flaw-to-steal-information-from-verified-users","1":"\/vinfo\/us\/security\/news\/cybercrime-and-digital-threats\/facebook-instagram-and-tinder-were-down-what-this-means-for-you","2":"https:\/\/www.securityweek.com\/turla-malware-obtains-cc-address-instagram-comments","3":"https:\/\/www.securityweek.com\/hackers-sell-celebrity-info-obtained-instagram-hack","4":"https:\/\/www.securityweek.com\/facebook-instagram-suffer-outage-deny-hacker-attack","5":"https:\/\/www.securityweek.com\/instagram-patches-privacy-vulnerability-exposed-private-photos","6":"https:\/\/www.securityweek.com\/instagram-yields-user-outrage-over-privacy-policy-change","7":"https:\/\/www.securityweek.com\/instagram-gets-two-factor-authentication","8":"https:\/\/www.securityweek.com\/flaws-allowed-hackers-brute-force-instagram-accounts","9":"https:\/\/www.securityweek.com\/facebook-threatens-researcher-over-instagram-hack","10":"https:\/\/www.securityweek.com\/instagram-app-exposes-users-man-middle-attacks-researcher"},"Title":{"0":"Hackers Exploit Instagram API Flaw to Steal Information from Verified Users  ","1":"Facebook, Instagram, and Tinder Were Down: What This Means for You","2":"Turla Malware Obtains C&C Address From Instagram Comments","3":"Hackers Sell Celebrity Info Obtained in Instagram Hack","4":"Facebook, Instagram Suffer Outage but Deny Hacker Attack","5":"Instagram Patches Privacy Vulnerability That Exposed Private Photos","6":"Instagram Yields to User Outrage Over Privacy Policy Change","7":"Instagram Gets Two-Factor Authentication","8":"Flaws Allowed Hackers to Brute-Force Instagram Accounts","9":"Facebook, Researcher Quarrel Over Instagram Hack","10":"Instagram App Exposes Users to Man-in-the-Middle Attacks: Researcher"},"Intro":{"0":"Hackers abused a bug in Instagram’s API and gained access to prominent users’ contact information. The company confirmed that email addresses and phone numbers were stolen.   ","1":"Facebook, Instagram, Tinder, and other sites were down for about an hour. Facebook is back up now and has sent a brief word  of how a change in infrastructure configuration could have caused the outage.","2":"Backdoor used by the Russia-linked cyberespionage group Turla obtains the address of its C&C server from comments posted to Instagram  [Read More]","3":"Hackers are selling phone numbers and email addresses of millions of celebrities and other high profile Instagram users  [Read More]","4":"An an outage at Facebook on Jan. 26 was not the result of a third party attack, Facebook said, but occurred after the company introduced a change that affected its configuration systems.  [Read More]","5":"A security published an advisory, detailing what he called a vulnerability that made it possible to gain access to private photo albums and profile information.  [Read More]","6":"Instagram backed down from a planned policy change that appeared to clear the way for the mobile photo sharing service to sell pictures without compensation, after users cried foul.  [Read More]","7":"Instagram, Facebook’s mobile photo-sharing and video sharing service, is finally getting a long requested security feature; two-factor authentication.  [Read More]","8":"A researcher received $5,000 from Facebook after finding a couple of vulnerabilities that could have been exploited to brute-force Instagram accounts  [Read More]","9":"Researcher discloses serious Instagram vulnerabilities after being threatened by Facebook  [Read More]","10":"A researcher posts details of a situation affecting the Instagram app for iOS that could leave users susceptible to man-in-the-middle attacks.  [Read More]"}}