{"Link":{"0":"https:\/\/www.securityweek.com\/pro-isis-hackers-compromise-us-centcom-twitter-youtube-accounts","1":"https:\/\/www.securityweek.com\/backdoored-phishing-templates-advertised-youtube","2":"https:\/\/www.securityweek.com\/malicious-youtube-pages-targeting-chrome-users","3":"https:\/\/www.securityweek.com\/vengeful-youtube-video-leads-prison-sentence-philadelphia-man","4":"https:\/\/www.securityweek.com\/behind-bars-hospital-guard-hacker-who-posted-his-crime-youtube","5":"\/vinfo\/us\/threat-encyclopedia\/spam\/31\/youtubemicrosoft-spam","6":"https:\/\/www.securityweek.com\/white-house-asked-youtube-review-anti-muslim-video","7":"https:\/\/www.securityweek.com\/just-watching-youtube-video-can-compromise-your-smartphone","8":"https:\/\/www.securityweek.com\/xss-flaw-youtube-gaming-earns-researcher-3000","9":"https:\/\/www.securityweek.com\/google-rewards-researchers-youtube-comment-theft-vulnerability","10":"https:\/\/www.securityweek.com\/youtube-flaw-allowed-removal-any-video-researcher"},"Title":{"0":"Pro-ISIS Hackers Compromise U.S. CENTCOM Twitter, YouTube Accounts","1":"Backdoored Phishing Templates Advertised on YouTube","2":"Malicious YouTube Pages Targeting Chrome Users","3":"Vengeful YouTube Video Leads to Prison Sentence for Philadelphia Man","4":"Behind Bars: The Hospital Guard Hacker Who Posted His Crime on YouTube","5":"Youtube-Microsoft Spam","6":"White House Asked YouTube to Review Anti-Muslim Video","7":"Just Watching a YouTube Video Can Compromise Your Smartphone","8":"XSS Flaw in YouTube Gaming Earns Researcher $3,000","9":"Google Rewards Researchers for YouTube Comment Theft Vulnerability","10":"YouTube Flaw Allowed Removal of Any Video: Researcher"},"Intro":{"0":"Hackers supporting Islamic State jihadists hacked the Twitter and YouTube accounts of the U.S. Central Command (CENTCOM), the Department of Defense confirmed Monday.  [Read More]","1":"Scammers are abusing YouTube as a new way to promote backdoored phishing templates and provide potential buyers with information on how to use the nefarious software, Proofpoint researchers warn.  [Read More]","2":"Researchers at Zscaler have discovered a fake YouTube page that is hosting malicious Chrome extensions. Such pages, as seen in the past, prey on the uninformed users with poorly patched systems to spread malware.  [Read More]","3":"Philadelphia Man Sentenced for Threatening U.S. Congressman via YouTube Video  [Read More]","4":"Jesse William McGraw, a former contract security guard at the North Central Medical Plaza in Dallas, who admitted hacking into that hospital’s computer systems, was recently sentenced to 110 months in Federal prison.  [Read More]","5":"From: youtube@Microsoft.msn.Read more   ","6":"The White House said Friday it had contacted video sharing website YouTube to ask for a review of an anti-Muslim\r\r\r\nmovie \"Innocence of Muslims\" that sparked riots and attacks on US diplomatic posts in the Arab World.  [Read More]","7":"Attackers can broadcast hidden voice commands from a loudspeaker at an event or to embed them in a trending YouTube video to compromise mobile devices.  [Read More]","8":"Google has awarded a researcher $3,133.7 for finding an XSS vulnerability in YouTube Gaming.  [Read More]","9":"YouTube vulnerability allowed users to copy any comment to their own video or channel. Google patched the bug and rewarded the researchers who found it.  [Read More]","10":"Logical flaw could have been exploited to delete any YouTube video. Google patched the bug and awarded $5,000 to the researcher who found it.  [Read More]"}}